testCases/T3A/kOmegaTrans/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Set output format : choice of
//      xmgr
//      jplot
//      gnuplot
//      raw
setFormat raw;

// Surface output format. Choice of
//      null        : suppress output
//      foamFile    : separate points, faces and values file
//      dx          : DX scalar or vector format
//      vtk         : VTK ascii format
//      raw         : x y z value format for use with e.g. gnuplot 'splot'.
//
// Note:
// other formats such as obj, stl, etc can also be written (by proxy)
// but without any values!
surfaceFormat raw;

// interpolationScheme. choice of
//	cell          : use cell-centre value only; constant over cells (default)
//	cellPoint     : use cell-centre and vertex values
//	cellPointFace : use cell-centre, vertex and face values.
// 1] vertex values determined from neighbouring cell-centre values
// 2] face values determined using the current face interpolation scheme
//    for the field (linear, gamma, etc.)
interpolationScheme cell;

// Fields to sample.
fields
(
   wallShearStress U k nut omega 
);


// Set sampling definition: choice of
//      uniform             evenly distributed points on line
//      face                one point per face intersection
//      midPoint            one point per cell, inbetween two face intersections
//      midPointAndFace     combination of face and midPoint
//
//      curve               specified points, not nessecary on line, uses
//                          tracking
//      cloud               specified points, uses findCell
//
// axis: how to write point coordinate. Choice of
// - x/y/z: x/y/z coordinate only
// - xyz: three columns
//  (probably does not make sense for anything but raw)
// - distance: distance from start of sampling line (if uses line) or
//             distance from first specified sampling point
//
// type specific:
//      uniform, face, midPoint, midPointAndFace : start and end coordinate
//      uniform: extra number of sampling points
//      curve, cloud: list of coordinates
sets
(
   line0045
   {
     type midPoint;
     axis y;
     start (0.045 0.0 1.e-6);
     end   (0.045 0.1 1.e-6);
   }
   line0095
   {
     type midPoint;
     axis y;
     start (0.095 0.0 1.e-6);
     end   (0.095 0.1 1.e-6);
   }
   line0195
   {
     type midPoint;
     axis y;
     start (0.195 0.0 1.e-6);
     end   (0.195 0.1 1.e-6);
   }
   line0295
   {
     type midPoint;
     axis y;
     start (0.295 0.0 1.e-6);
     end   (0.295 0.1 1.e-6);
   }
   line0395
   {
     type midPoint;
     axis y;
     start (0.395 0.0 1.e-6);
     end   (0.395 0.1 1.e-6);
   }
   line0495
   {
     type midPoint;
     axis y;
     start (0.495 0.0 1.e-6);
     end   (0.495 0.1 1.e-6);
   }
   line0595
   {
     type midPoint;
     axis y;
     start (0.595 0.0 1.e-6);
     end   (0.595 0.1 1.e-6);
   }
   line0695
   {
     type midPoint;
     axis y;
     start (0.695 0.0 1.e-6);
     end   (0.695 0.1 1.e-6);
   }
   line0795
   {
     type midPoint;
     axis y;
     start (0.795 0.0 1.e-6);
     end   (0.795 0.1 1.e-6);
   }
   line0895
   {
     type midPoint;
     axis y;
     start (0.895 0.0 1.e-6);
     end   (0.895 0.1 1.e-6);
   }
   line0995
   {
     type midPoint;
     axis y;
     start (0.995 0.0 1.e-6);
     end   (0.995 0.1 1.e-6);
   }
   line1095
   {
     type midPoint;
     axis y;
     start (1.095 0.0 1.e-6);
     end   (1.095 0.1 1.e-6);
   }
   line1195
   {
     type midPoint;
     axis y;
     start (1.195 0.0 1.e-6);
     end   (1.195 0.1 1.e-6);
   }
   line1295
   {
     type midPoint;
     axis y;
     start (1.295 0.0 1.e-6);
     end   (1.295 0.1 1.e-6);
   }
   y01
   {
     type midPoint;
     axis x;
     start (-1 0.1 1.e-6);
     end   (3 0.1 1.e-6);
   }
   
);


// Surface sampling definition: choice of
//      plane : values on plane defined by point, normal.
//      patch : values on patch.
//
// 1] patches are not triangulated by default
// 2] planes are always triangulated
// 3] iso-surfaces are always triangulated
surfaces
(
   wall
   {
       type patch;
       patches  ("lowerWall");
       interpolate false;
   }

);


// *********************************************************************** //
